Revit 2026 API

# PartMakerMethodForWallFailures Properties

---

The BuiltInFailuresPartMakerMethodForWallFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CouldNotAdjustWallPartsAtJoin | Failed to extend or trim some layer at an end join |
|  | CouldNotCreateWallPart | Failed to create basic layer geometry. Probably a failure either to create the cutter or to intersect the cutter with the wall geometry. |
|  | CouldNotCreateWallPartDueToWallJoin | Failed to create basic layer geometry due to an excessively short edge created by wall join. |

#### Reference

BuiltInFailuresPartMakerMethodForWallFailures Class

Autodesk.Revit.DB Namespace